# 1

In [110]:
f = open("teks.txt", "w")
f.write("Pelatihan kita di LPPI Kemang dengan waktu yang telah ditentukan!!")
f.close()

In [111]:
f = open("teks.txt", "r")
f.read()
f.close()

In [112]:
import re
def modify(file, char):
    with open('teks.txt') as f:
        lines = [line.rstrip('\n') for line in f]
    lines = lines[0].split()
    awal = lines[:char]
    akhir = lines[char:]
    
    f = open('teks.txt', 'w') #w write (menimpa yg sebelumnya)
    f.write(' '.join([str(i) for i in awal]) + ' dari pagi sampai sore ' 
            + ' '.join([str(i) for i in akhir]))
    f.close()

In [113]:
modify('teks.txt', 6)

In [114]:
f = open('teks.txt')
f.read()

'Pelatihan kita di LPPI Kemang dengan dari pagi sampai sore waktu yang telah ditentukan!!'

# 2

In [61]:
def writing(nama):
    with open('ex2.txt', 'a') as f:
        f.write(f'Hasil perhitungan Desimal, Octal, Biner, dan Hexa dari huruf {nama} adalah \n')
        
    result = ''

    for i in range(len(nama)):
        desimal1 = ord(nama[i])

        biner = ''
        oktal = ''
        hexa = ''

        #binary
        desimal = desimal1
        while desimal > 0:
            sisa = desimal % 2
            biner = str(sisa) + biner
            desimal //= 2

        #octal
        desimal = desimal1
        while desimal > 0:
            sisa = desimal % 8
            oktal = str(sisa) + oktal
            desimal //= 8

        #hexadecimal
        hex_chars = "0123456789ABCDEF"
        desimal = desimal1
        while desimal > 0:
             sisa = desimal % 16
             hexa = hex_chars[sisa] + hexa
             desimal //= 16
        
        result = f"{nama[i]} = {desimal1}, {biner}, {oktal}, {hexa} \n"
        
        f = open('ex2.txt', 'a')
        f.write(result)
        f.close()
        
nama = input("Nama : ")
ruang = input("Ruang : ")
Skema = input("Skema : ")
writing(nama)

Nama : Ani
Ruang : a
Skema : a

# 3

In [34]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/regita/anaconda3/lib/python3.11/site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [116]:
import mysql.connector

In [117]:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "sakila"
)

In [118]:
lat = mydb.cursor()

In [131]:
sql = "INSERT INTO actor (first_name, last_name, ) VALUES (%s, %s)"
val = ("John", "Highway")
lat.execute(sql, val)

mydb.commit()

print(lat.rowcount, "record(s) inserted.")

1 record inserted.

In [136]:
sql = "UPDATE actor SET first_name=%s, last_name=%s WHERE actor_id=%s"
val = ("Anne", "Gal", 202)
lat.execute(sql, val)

mydb.commit()

print(lat.rowcount, "record(s) updated.")

1 record inserted.

In [145]:
sql = "INSERT INTO actor (first_name, last_name) VALUES (%s, %s)"
val = [
    ("Michele", "Choi"),
    ("Nelly", "Carpenter")
]
lat.executemany(sql, val)

mydb.commit()

print(lat.rowcount, "record(s) inserted.")

2 record(s) inserted.

In [161]:
sql = "DELETE FROM actor WHERE actor_id = 201"
# sql = "DELETE FROM actor WHERE actor_id = 201 AND actor_id = 202"
lat.execute(sql)

mydb.commit()

print(lat.rowcount, "record(s) deleted.")

0 record(s) inserted.

In [162]:
lat.execute("select * from film")
myresult = lat.fetchall()

sql_query = pd.read_sql_query ('''
                               SELECT * FROM actor
                               ''', mydb)

df = pd.DataFrame(sql_query)
df

/var/folders/hz/213j1qjd4cx4s8qq5rvxmsy40000gn/T/ipykernel_2913/1794206031.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33
200       202       Anne           Gal 2024-02-02 13:47:07
201       203    Michele          Choi 2024-02-02 13:54:38
202       204      Nelly     Carpenter 2024-02-02 13:54:38

[203 rows x 4 columns]

In [182]:
df.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [163]:
df.dtypes

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [170]:
df[['first_name', 'last_name']].describe()

       first_name last_name
count         203       203
unique        131       124
top      PENELOPE    KILMER
freq            4         5

In [171]:
df['last_update'].describe()

count                              203
mean     2006-05-23 03:46:02.477832192
min                2006-02-15 04:34:33
25%                2006-02-15 04:34:33
50%                2006-02-15 04:34:33
75%                2006-02-15 04:34:33
max                2024-02-02 13:54:38
Name: last_update, dtype: object

In [172]:
len(df)

203

In [180]:
df.isnull().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64